{
  "updated": "2026-02-28T19:11:25.798Z",
  "auto_fetched": true,
  "xrp": {
    "price": 1.34,
    "change_24h": -0.812306160424502,
    "volume_24h": 3631153482.2810626,
    "market_cap": 81843163601.57852
  },
  "rlusd": {
    "market_cap": 1495114718.1572187,
    "source": "coingecko"
  },
  "macro": {
    "usd_jpy": 155.98,
    "jpn_10y": 2.24,
    "us_10y_yield": 4.02,
    "brent_crude": 71.9,
    "fear_greed": {
      "value": 11,
      "label": "Extreme Fear"
    }
  },
  "manual": {
    "odl_volume_annualized": null,
    "xrp_etf_aum": null,
    "rlusd_circulation": null,
    "permissioned_dex_institutions": null,
    "clarity_act_status": "Pending",
    "_last_manual_update": null
  },
  "kill_switches": {
    "odl_volume": {
      "target": 25000000000,
      "current": null,
      "deadline": "2026-12-31",
      "status": "NEEDS_DATA",
      "pct_complete": null
    },
    "rlusd_circulation": {
      "target": 5000000000,
      "current": 1495114718.1572187,
      "deadline": "2026-12-31",
      "status": "TRACKING",
      "pct_complete": 30
    },
    "xrp_etf_aum": {
      "target": 5000000000,
      "current": null,
      "deadline": "2026-12-31",
      "status": "NEEDS_DATA",
      "pct_complete": null
    },
    "permissioned_dex_adoption": {
      "target_institutions": 5,
      "current": null,
      "deadline": "2026-09-30",
      "status": "NEEDS_DATA"
    },
    "clarity_act": {
      "target": "passed_or_advanced",
      "current": "pending",
      "deadline": "2026-12-31",
      "status": "PENDING"
    }
  },
  "thesis_scores": {
    "regulatory": {
      "status": "CONFIRMED",
      "confidence": "high"
    },
    "institutional_custody": {
      "status": "STRONG",
      "confidence": "high"
    },
    "etf_adoption": {
      "status": "CONFIRMED",
      "confidence": "high"
    },
    "xrpl_infrastructure": {
      "status": "ACCELERATING",
      "confidence": "high"
    },
    "stablecoin_adoption": {
      "status": "GROWING — MOMENTUM WATCH",
      "confidence": "medium"
    },
    "odl_volume": {
      "status": "NEEDS_DATA",
      "confidence": "low"
    },
    "japan_adoption": {
      "status": "FAVORABLE",
      "confidence": "medium"
    },
    "macro_environment": {
      "status": "STRESSED — APPROACHING ELEVATED",
      "confidence": "medium"
    }
  },
  "probability": {
    "bear": 13,
    "base": 42,
    "mid": 34,
    "bull": 11,
    "last_updated": "2026-02-28T19:14:01.486Z",
    "last_reasoning": "Bear case increases from 10% to 13%: XRP at $1.34 with F&G at 11 and compounding macro stress. Price is only 25% above the <$1 bear threshold. RLUSD momentum stalling. Base case narrows slightly from 40% to 42% — this remains the most likely outcome but with less upside skew. Mid case reduced from 38% to 34% — the institutional buildout hasn't translated to price action, and the macro headwind is real. Bull case trimmed from 12% to 11% — nothing in current data supports expansion of the tail scenario. The overall shift is toward caution, driven by sentiment capitulation and JGB stress acceleration."
  },
  "bear_case": {
    "counter_thesis_score": 72,
    "score_reasoning": "Score elevated from prior baseline due to: RLUSD momentum stalling at $1.495B (declining, not growing), XRP price action disconnected from institutional narrative, extreme fear sentiment, and 3/5 kill switches unmonitorable. The infrastructure-without-activity gap is the core vulnerability.",
    "competing_infrastructure": [
      {
        "name": "SWIFT GPI",
        "status": "MONITORING",
        "status_text": "SWIFT gpi continues expanding same-day settlement coverage. No XRPL integration signals. SWIFT's incumbency advantage remains the primary competitive threat to the thesis."
      },
      {
        "name": "Visa B2B Connect",
        "status": "LOW_RISK",
        "status_text": "B2B Connect operational but not expanding aggressively into the settlement layer space XRP targets. Watching for stablecoin integration announcements."
      },
      {
        "name": "JPMorgan Kinexys",
        "status": "MONITORING",
        "status_text": "Kinexys (ex-Onyx) continues processing significant daily volumes for JPM clients. Direct competitor to Ripple's institutional custody/settlement positioning. Monitor for expansion beyond JPM ecosystem."
      },
      {
        "name": "BIS Project Nexus",
        "status": "ELEVATED_RISK",
        "status_text": "BIS Nexus advancing as central-bank-endorsed alternative for cross-border instant payments. If Nexus achieves independent operation without XRPL dependency, it directly threatens the thesis. Kill switch #9 applies."
      },
      {
        "name": "Ethereum Institutional",
        "status": "MONITORING",
        "status_text": "Ethereum L2s and institutional DeFi continue attracting capital. BlackRock's BUIDL fund on Ethereum remains the largest tokenized treasury product, outpacing XRPL equivalents."
      }
    ],
    "odl_stagnation": "ODL volume remains entirely unverifiable — no public data exists. The thesis's central payment-rail claim is unsubstantiated by observable metrics, which is a structural weakness, not merely a data gap.",
    "token_velocity_concern": "Token velocity data unavailable (kill switch #8 UNKNOWN). If XRP is being used as a bridge currency with immediate conversion, price appreciation may be structurally limited regardless of volume growth.",
    "macro_headwinds": [
      {
        "name": "Global Recession Risk",
        "status": "ELEVATED_RISK",
        "status_text": "F&G at 11, JGB stress rising, Section 122 tariffs active — multiple recessionary signals converging. Cross-border payment volume correlates with trade activity, which contracts in recession."
      },
      {
        "name": "Crypto Winter Signals",
        "status": "ELEVATED_RISK",
        "status_text": "F&G at 11 is consistent with early crypto winter conditions. XRP at $1.34 has retraced significantly. Extended drawdown would pressure ETF flows and institutional commitment timelines."
      },
      {
        "name": "Regulatory Reversal Risk",
        "status": "LOW_RISK",
        "status_text": "Current US administration is crypto-favorable. Clarity Act pending. Risk remains low but political bandwidth consumed by tariff expiry (Jul 20) and geopolitical crises could delay legislative progress."
      },
      {
        "name": "Rate Hike Extension",
        "status": "MONITORING",
        "status_text": "US 10Y at 4.02% suggests rates staying higher for longer. BOJ hiking to 1.0% would further tighten global liquidity. Not yet acute but direction is hawkish across major central banks."
      }
    ],
    "bear_narrative": "The XRP institutional settlement thesis is flying blind: its core metric (ODL volume) has been dark for two years while three competing settlement infrastructures — SWIFT-Chainlink CCIP (12+ banks live), CBDC mBridge (real-value MVP complete), and USDC-CCTP ($15B+ cumulative) — are advancing across every institutional lane XRP claims to serve, all without any XRP involvement. Fear & Greed has triggered at 11, the bias ratio is 2.5:1 bearish against thesis scoring that still reads CONFIRMED/HIGH, and the system has seven critical blind spots it wasn't tracking. REDUCE EXPOSURE — hold only what you can justify with verifiable data, which right now is very little.",
    "last_updated": "2026-02-28T19:14:01.486Z"
  },
  "last_analysis": {
    "timestamp": "2026-02-28T19:14:01.486Z",
    "run_type": "evening",
    "stress_level": "ELEVATED",
    "stress_score": 62,
    "applied_at": "2026-02-28T19:15:22.476Z",
    "changes_applied": 2
  }
}